tutorials/solvers/interPlicFoam/dropletImpact/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (oil air);

oil
{
    transportModel  Newtonian;
    nu              5.011e-06;
    rho             910.0;
}

air
{
    transportModel  Newtonian;
    nu              1.562e-05;
    rho             1.183;
}

sigma           0.0197;


// ************************************************************************* //
