tutorials/solvers/interPlicFoam/dropletImpact/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.oil.*"
    {
        nAlphaBounds        3;

        mixedCellTol        1e-10;
        snapTol             1e-12;
        clip                true;

        orientationMethod   LS; //RDF
        splitWarpedFace     false;
        writePlicFields     false;
        mapAlphaField       true;

        nAlphaSubCycles     1;
        cAlpha              1;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        relTol          0.01;
        //smoother        DIC;
        cacheAgglomeration no;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
        tolerance       1e-9;
    }

    "pcorr.*"
    {
        $p_rghFinal;
        tolerance       1e-08;
    }

    "U.*"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-07;
        relTol          0;
        nSweeps         1;
    }

    "(k|omega|B|nuTilda).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor           no;
    nCorrectors                 5;
    nNonOrthogonalCorrectors    1;
    correctPhi                  yes;

    pRefPoint      (0.51 0.51 0.51);
    pRefValue      0;
}


// ************************************************************************* //
