tutorials/solvers/interPlicFoam/dropletImpact/system/setVofFieldDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          initializeAlphaFieldDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

field                   "alpha.oil";
initial                 0.0;
snapTol                 1e-12;

triangulationScheme     "fan";
extraBooleanCheck       false;

exportPlicSurface       false;
exportIsoSurface        false;
writeShapes             true;

shapes
{
    pool
    {
        type            box;
        min             (-0.011 -0.011 -0.001);
        max             ( 0.011  0.011  0.01);
        mode            add;
    }

    droplet
    {
        type            sphere;
        radius          0.001;
        centre          (0.0 0.0 0.012);
        subdivision     5;
        mode            add;
    }
}


// ************************************************************************* //
